03-For-an-editor/init-write-documents.org
#+TITLE: 用Emacs写文档
#+LANGUAGE:  zh
#+AUTHOR: Lu Jianmei
#+EMAIL: lu.jianmei@trs.com.cn
#+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t p:t pri:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t email:t
#+DESCRIPTION: A notes that include all works and study things in 2015
#+KEYWORDS:  org-mode Emacs jquery jquery.mobile jquery.ui wcm
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setCJKmainfont{SimSun}
#+LATEX_CLASS: cn-article
#+STARTUP: logredeadline, logreschedule
#+ATTR_HTML: :border 2 :rules all :frame all

** Gernal packages configurations
当前分类下，列出支持的包的配置信息。
*** Auto complete using company-mode
自动完成功能的配置，可以基于它针对不同的语言进行配置自动提示功能；
#+begin_src emacs-lisp :tangle yes
    ;; Turn on auto complete.
  ;;  (require 'auto-complete-config)       
    ;;(ac-config-default)

  (use-package company
    :defer t
    :config (add-hook 'prog-mode-hook 'company-mode))

#+end_src

*** Manage the dash package
此包用于在macbook上调用dash应用的功能，其它操作系统可以不用；
#+begin_src emacs-lisp :tangle yes
  (use-package dash
    :defer t)
#+end_src

*** Config the backups
配置自动备份；
#+BEGIN_SRC emacs-lisp :tangle yes
;;(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq backup-directory-alist '(("." . (expand-file-name "backups" user-emacs-directory))))
#+END_SRC

*** Save files
Emacs中的自动保存功能，单独存储在另一个文件夹中。
#+BEGIN_SRC emacs-lisp :tangle yes
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
;;(setq auto-save-file-name-transforms '((".*" (expand-file-name "auto-save-list" user-emacs-directory) t)))
#+END_SRC

*** Save history
保存历史记录
From http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp :tangle yes
;;(setq savehist-file "~/.emacs.d/savehist")
(setq savehist-file (expand-file-name "savehist" user-emacs-directory))
(savehist-mode 1)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
#+END_SRC

*** Org mode
**** Org-mode Base configuration
For org mode base configuration, please find [[file:../03-For-an-editor/init-org-mode.org][Init-Org-mode]].
#+begin_src emacs-lisp :tangle yes
;; load my own org-mode configuration from init-org-mode.el
  (starter-kit-load "03-For-an-editor/init-org-mode.org")
;;(require 'init-org-mode)
;;(load-library "init-org-mode")


#+end_src

**** Org-mode Agenda view configuration
For org mode agenda view configuration, please find  [[file:../03-For-an-editor/init-org-agenda-view.org][Init-Org-Agenda-View]].
#+begin_src emacs-lisp :tangle yes
;; load my own org-mode configuration from init-org-agenda-view.el
  (starter-kit-load "03-For-an-editor/init-org-agenda-view.org")
;;(require 'init-org-agenda-view)
;;(load-library "init-org-agenda-view")
#+end_src

**** Org-mode table shift configuration
For org mode agenda view configuration, please find  [[file:../03-For-an-editor/init-org-table-shift.org][Init-Org-table-shift]].
#+begin_src emacs-lisp :tangle yes
;; load my own org-mode configuration from init-org-table-shift.el
  (starter-kit-load "03-For-an-editor/init-org-table-shift.org")
;;(require 'init-org-table-shift)
;;(load-library "init-org-table-shift")
#+end_src

**** Key bindings configurations
#+begin_src emacs-lisp :tangle yes
;; -----------------------------------------
;;key bindings for org mode
;; -----------------------------------------

(global-unset-key (kbd "C-'")) ;; this setting has no use, and conflict with smart


;;(global-set-key (kbd "<f12>") 'org-agenda) ;; configured blew
(global-set-key (kbd "<f9> c") 'calendar)
(global-set-key (kbd "<f9> v") 'visible-mode)
(global-set-key (kbd "C-c c") 'org-capture)

;; add ~/notes/front-end-dev-plan.org into agenda
;; (setq org-agenda-files (list "~/notes/front-end-dev-plan.org"))
(global-set-key "\C-c a" 'org-agenda)
;; I use C-c c to start capture mode
(global-set-key (kbd "C-c c") 'org-capture)


;; config for export-mutilpul files
(global-set-key (kbd "C-<f12>") 'bh/save-then-publish)

;; config for clocking
(global-set-key (kbd "<f9> I") 'bh/punch-in)
(global-set-key (kbd "<f9> O") 'bh/punch-out)

(global-set-key (kbd "<f9> l") 'org-toggle-link-display)
(global-set-key (kbd "<f9> SPC") 'bh/clock-in-last-task)

(global-set-key (kbd "<f11>") 'org-clock-goto)
(global-set-key (kbd "C-<f11>") 'org-clock-in)



#+end_src
