03-For-an-editor/init-write-documents.org
*** Macros

**** Key bindings configuration for Macros
#+begin_src emacs-lisp :tangle yes

#+end_src
**** Key bindings for Macros
#+CAPTION: Org-mode快捷键
     #+ATTR_LATEX: :environment longtable :align l|l|l
|--------------------+-------------------------+-----------------------------------------------------------------------------------------------|
| 宏                 | C-x (                   | 开始录制宏                                                                                    |
|                    | C-x )                   | 结束录制宏                                                                                    |
|                    | C-x e                   | 使用宏                                                                                        |
|                    | C-u                     | 重复使用宏，C-u 100 C-x e重复100次                                                            |
|                    | M-x name-last-kbd-macro | 保存宏，可以在其它地方通过M-x调用此保存好的宏                                                 |
|--------------------+-------------------------+-----------------------------------------------------------------------------------------------|
|                    |                         |                                                                                               |

*** Markdown mode

**** Configuration
For markdown mode base configuration, please find [[file:../lisp/init-markdown-mode.el][Init-markdown-mode]].
#+begin_src emacs-lisp :tangle yes

;; load my own markdown mode configuration from lisp/init-markdown-mode.el
(require 'init-markdown-mode)

#+end_src
*** Tramp
**** Configuration
#+begin_src emacs-lisp :tangle yes
;; setting for tramp
(setq tramp-default-method "ssh")

;; config for caching password for 36000s
(setq password-cache-expiry 36000)

#+end_src
*** DONE Winner mode - undo and redo window configuration
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]

=winner-mode= lets you use =C-c <left>= and =C-c <right>= to switch between window configurations. This is handy when something has popped up a buffer that you want to look at briefly before returning to whatever you were working on. When you're done, press =C-c <left>=.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package winner
  :defer t)
#+END_SRC

*** DONE Mode line format
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
Display a more compact mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smart-mode-line
    :defer t)
#+END_SRC

*** DONE Undo tree
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
Allow us to visually walk through the changes you've made, undo back to a certain point (or redo), and go down different branches.
Shot key binding: =(C-x u)=
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package undo-tree
    :defer t
    :diminish undo-tree-mode
    :config
    (progn
      (global-undo-tree-mode)
      (setq undo-tree-visualizer-timestamps t)
      (setq undo-tree-visualizer-diff t)))

#+END_SRC

*** DONE Help - guide key
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
This library is very helpful, we can use it to help us remember or find the shot key binding. It will pops up a mini-buffer to show us the shot-key when we typed first part with a shot delay.
=(guide-key)= 包可以帮助我们查看操作的快捷键，对于一些不太常用的快捷键想不起来的时候，可以输入快捷键的前缀后，暂停一下，Emacs即会弹出一个子窗口，列出当前前缀下可以选择的快捷键，及其函数名称。以方便我们进行查找。
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package guide-key
  :defer t
  :diminish guide-key-mode
  :config
  (progn
  (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
  (guide-key-mode 1)))  ; Enable guide-key-mode
#+END_SRC
*** DONE Encoding configruation
    - State "DONE"       from ""           [2016-05-29 Sun 07:03]
This configuration from: http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp :tangle yes
(prefer-coding-system 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

*** DONE Helm
    - State "DONE"       from ""           [2016-05-29 Sun 07:03]

