03-For-an-editor/init-write-documents.md

## Macros<a id="sec-1-7" name="sec-1-7"></a>

### Key bindings configuration for Macros<a id="sec-1-7-1" name="sec-1-7-1"></a>

### Key bindings for Macros<a id="sec-1-7-2" name="sec-1-7-2"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Org-mode快捷键</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">宏</th>
<th scope="col" class="left">C-x (</th>
<th scope="col" class="left">开始录制宏</th>
</tr>


<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">C-x )</th>
<th scope="col" class="left">结束录制宏</th>
</tr>


<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">C-x e</th>
<th scope="col" class="left">使用宏</th>
</tr>


<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">C-u</th>
<th scope="col" class="left">重复使用宏，C-u 100 C-x e重复100次</th>
</tr>


<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">M-x name-last-kbd-macro</th>
<th scope="col" class="left">保存宏，可以在其它地方通过M-x调用此保存好的宏</th>
</tr>
</thead>

<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

## Markdown mode<a id="sec-1-8" name="sec-1-8"></a>

### Configuration<a id="sec-1-8-1" name="sec-1-8-1"></a>

For markdown mode base configuration, please find [Init-markdown-mode](../03-For-an-editor/init-markdown-mode.el).

    ;; load my own markdown mode configuration from init-markdown-mode.el
    ;;(require 'init-markdown-mode)
      (starter-kit-load "03-For-an-editor/init-markdown-mode.org")

## Tramp<a id="sec-1-9" name="sec-1-9"></a>

### Configuration<a id="sec-1-9-1" name="sec-1-9-1"></a>

    ;; setting for tramp
    (setq tramp-default-method "ssh")
    
    ;; config for caching password for 36000s
    (setq password-cache-expiry 36000)

## DONE Winner mode - undo and redo window configuration<a id="sec-1-10" name="sec-1-10"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:02]</span></span>

`winner-mode` lets you use `C-c <left>` and `C-c <right>` to switch between window configurations. This is handy when something has popped up a buffer that you want to look at briefly before returning to whatever you were working on. When you're done, press `C-c <left>`.

    (use-package winner
      :defer t)

## DONE Mode line format<a id="sec-1-11" name="sec-1-11"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:02]</span></span>

Display a more compact mode line

    (use-package smart-mode-line
      :defer t)

## DONE Undo tree<a id="sec-1-12" name="sec-1-12"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:02]</span></span>

Allow us to visually walk through the changes you've made, undo back to a certain point (or redo), and go down different branches.
Shot key binding: `(C-x u)`

    (use-package undo-tree
      :defer t
      :diminish undo-tree-mode
      :config
      (progn
        (global-undo-tree-mode)
        (setq undo-tree-visualizer-timestamps t)
        (setq undo-tree-visualizer-diff t)))

## DONE Help - guide key<a id="sec-1-13" name="sec-1-13"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:02]</span></span>

This library is very helpful, we can use it to help us remember or find the shot key binding. It will pops up a mini-buffer to show us the shot-key when we typed first part with a shot delay.
`(guide-key)` 包可以帮助我们查看操作的快捷键，对于一些不太常用的快捷键想不起来的时候，可以输入快捷键的前缀后，暂停一下，Emacs即会弹出一个子窗口，列出当前前缀下可以选择的快捷键，及其函数名称。以方便我们进行查找。

    (use-package guide-key
      :defer t
      :diminish guide-key-mode
      :config
      (progn
      (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
      (guide-key-mode 1)))  ; Enable guide-key-mode

## DONE Encoding configruation<a id="sec-1-14" name="sec-1-14"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:03]</span></span>

This configuration from: <http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html>

    (prefer-coding-system 'utf-8)
    (when (display-graphic-p)
      (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
