03-For-an-editor/init-write-documents.md

## DONE Snippets<a id="sec-1-17" name="sec-1-17"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:04]</span></span>

Snippets工具可以让我们使用定义好的代码片断，或者文本块，从而可以通过快捷键的方式快速录入。从而提高录入速度。

    (use-package yasnippet
      :defer t
      :diminish yas-minor-mode
      :init (yas-global-mode)
      :config
      (progn
        (yas-global-mode)
        (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
        (setq yas-key-syntaxes '("w_" "w_." "^ "))
        ;;(setq yas-installed-snippets-dir "~/emacs.d-new/yasnippet-snippets")
        (setq yas-installed-snippets-dir (expand-file-name "yasnippet-snippets" user-emacs-directory))
        (setq yas-expand-only-for-last-commands nil)
        (yas-global-mode 1)
        (bind-key "\t" 'hippie-expand yas-minor-mode-map)
        (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)))
    
    
    (defun shk-yas/helm-prompt (prompt choices &optional display-fn)
      "Use helm to select a snippet. Put this into `yas/prompt-functions.'"
      (interactive)
      (setq display-fn (or display-fn 'identity))
      (if (require 'helm-config)
          (let (tmpsource cands result rmap)
            (setq cands (mapcar (lambda (x) (funcall display-fn x)) choices))
            (setq rmap (mapcar (lambda (x) (cons (funcall display-fn x) x)) choices))
            (setq tmpsource
                  (list
                   (cons 'name prompt)
                   (cons 'candidates cands)
                   '(action . (("Expand" . (lambda (selection) selection))))
                   ))
            (setq result (helm-other-buffer '(tmpsource) "*helm-select-yasnippet"))
            (if (null result)
                (signal 'quit "user quit!")
              (cdr (assoc result rmap))))
        nil))
    
    
    (setq default-cursor-color "gray")
    (setq yasnippet-can-fire-cursor-color "purple")
    
    ;; It will test whether it can expand, if yes, cursor color -> green.
    (defun yasnippet-can-fire-p (&optional field)
      (interactive)
      (setq yas--condition-cache-timestamp (current-time))
      (let (templates-and-pos)
        (unless (and yas-expand-only-for-last-commands
                     (not (member last-command yas-expand-only-for-last-commands)))
          (setq templates-and-pos (if field
                                      (save-restriction
                                        (narrow-to-region (yas--field-start field)
                                                          (yas--field-end field))
                                        (yas--templates-for-key-at-point))
                                    (yas--templates-for-key-at-point))))
        (and templates-and-pos (first templates-and-pos))))
    
    (defun my/change-cursor-color-when-can-expand (&optional field)
      (interactive)
      (when (eq last-command 'self-insert-command)
        (set-cursor-color (if (my/can-expand)
                              yasnippet-can-fire-cursor-color
                            default-cursor-color))))
    
    (defun my/can-expand ()
      "Return true if right after an expandable thing."
      (or (abbrev--before-point) (yasnippet-can-fire-p)))
    
                                            ; As pointed out by Dmitri, this will make sure it will update color when needed.
    (remove-hook 'post-command-hook 'my/change-cursor-color-when-can-expand)
    
    (defun my/insert-space-or-expand ()
      "For binding to the SPC SPC keychord."
      (interactive)
      (condition-case nil (or (my/hippie-expand-maybe nil) (insert "  "))))
    
    (defun my/hippie-expand-maybe (arg)
      "Try to expand text before point, using multiple methods.
    The expansion functions in `hippie-expand-try-functions-list' are
    tried in order, until a possible expansion is found.  Repeated
    application of `hippie-expand' inserts successively possible
    expansions.
    With a positive numeric argument, jumps directly to the ARG next
    function in this list.  With a negative argument or just \\[universal-argument],
    undoes the expansion."
      (interactive "P")
      (require 'hippie-exp)
      (if (or (not arg)
              (and (integerp arg) (> arg 0)))
          (let ((first (or (= he-num -1)
                           (not (equal this-command last-command)))))
            (if first
                (progn
                  (setq he-num -1)
                  (setq he-tried-table nil)))
            (if arg
                (if (not first) (he-reset-string))
              (setq arg 0))
            (let ((i (max (+ he-num arg) 0)))
              (while (not (or (>= i (length hippie-expand-try-functions-list))
                              (apply (nth i hippie-expand-try-functions-list)
                                     (list (= he-num i)))))
                (setq i (1+ i)))
              (setq he-num i))
            (if (>= he-num (length hippie-expand-try-functions-list))
                (progn (setq he-num -1) nil)
              (if (and hippie-expand-verbose
                       (not (window-minibuffer-p)))
                  (message "Using %s"
                           (nth he-num hippie-expand-try-functions-list)))))
        (if (and (>= he-num 0)
                 (eq (marker-buffer he-string-beg) (current-buffer)))
            (progn
              (setq he-num -1)
              (he-reset-string)
              (if (and hippie-expand-verbose
                       (not (window-minibuffer-p)))
                  (message "Undoing expansions"))))))
