03-For-an-editor/init-write-documents.org
*** DONE Avy

Quickly jump to a position in the current view.
已经转使用ace-isearch，因此此种配置可以去掉。也可以单独保留，与ace-isearch不冲突。
#+begin_src emacs-lisp :tangle yes
  (use-package avy
    :defer t)
    ;; I use the jj key-chord for this; see the definitions for key-chord
  (use-package avy-zap
    :defer t
    :bind
    (("M-z" . avy-zap-up-to-char-dwim)
     ("M-Z" . avy-zap-to-char-dwim)))
#+end_src
*** DONE Ace-isearch mode
    - State "DONE"       from ""           [2016-05-30 Mon 20:18]
Ace-isearch为集成了isearch, ace-jump-mode, avy, helm-swoop四个模式为一体的更方便的搜索体验。
Ace-isearch会根据输入的内容长度，来判断采用哪种模式。
The "default" behavior can be summrized as:
    + L = 1 : ace-jump-mode or avy
    + 1 < L < 6 : isearch
    + L >= 6 : helm-swoop

在实际使用时，如果我需要定位到当前屏幕的具体位置时，则输入第一个字母，然后稍等一下，即启动ace-jump-mode，屏幕此时会Mark上和我输入的首字母相同的位置，并通过不同和字母显示位置，我们只需要根据它显示的位置输入显示的字母，即可完成精准定位。
但当我需要输入一个单词进行搜索时，则输入内容在1-6个字母时，采用的是isearch，即字母完全匹配的全文搜索模式。
当字母大于6个时，即自动启动helm-swoop模式，进行快速选择。


#+begin_src emacs-lisp :tangle yes
  (use-package ace-isearch
    :config
    (progn
      (global-ace-isearch-mode +1) ;; start this for global
      ;;(setq ace-isearch-funtion-from-isearch 'swoop-from-isearch) ; need to install swoop
      ;;(define-key swoop-map (kbd "C-s") 'swoop-action-goto-line-next)
      ;;(define-key swoop-map (kbd "C-r") 'swoop-action-goto-line-prev)
      (setq ace-isearch-funtion-from-isearch 'helm-swoop-from-isearch)
      ;; (setq ace-isearch-funtion-from-isearch 'helm-occur-from-isearch) ; alternative way

      ;; blew configuration can be support for Chinese
      (defadvice ace-jump-char-category (around adv-ace-jump-support-umlauts activate)
        (unless (= (char-syntax (ad-get-arg 0)) ?w)
          ad-do-it)
        (setq ad-return-value 'alpha))

      ;; base configuration 
      (custom-set-variables
       '(ace-isearch-input-length 6)
       '(ace-isearch-jump-delay 0.25)
       '(ace-isearch-function 'ace-jump-word-mode)
       ;;'(ace-isearch-function 'avy-goto-char)
       '(ace-isearch-use-jump 'printing-char))
      (define-key isearch-mode-map (kbd "C-'") 'ace-isearch-jump-during-isearch)
      )
  )


#+end_src
*** DONE Edit-list
    - State "DONE"       from ""           [2016-05-29 Sun 07:04]
M-x edit-list makes it easier to edit an Emacs Lisp list.
#+ombegin_src emacs-lisp :tangle yes
  (use-package edit-list
    :defer t
    :commands edit-list)
#+end_src
*** DONE Zap to isearch
    - State "DONE"       from ""           [2016-05-29 Sun 07:04]
From Steve Purcell, who linked to http://www.emacswiki.org/emacs/ZapToISearch
#+begin_src emacs-lisp :tangle yes
(defun zap-to-isearch (rbeg rend)
  "Kill the region between the mark and the closest portion of
the isearch match string. The behaviour is meant to be analogous
to zap-to-char; let's call it zap-to-isearch. The deleted region
does not include the isearch word. This is meant to be bound only
in isearch mode.  The point of this function is that oftentimes
you want to delete some portion of text, one end of which happens
to be an active isearch word. The observation to make is that if
you use isearch a lot to move the cursor around (as you should,
it is much more efficient than using the arrows), it happens a
lot that you could just delete the active region between the mark
and the point, not include the isearch word."
  (interactive "r")
  (when (not mark-active)
    (error "Mark is not active"))
  (let* ((isearch-bounds (list isearch-other-end (point)))
         (ismin (apply 'min isearch-bounds))
         (ismax (apply 'max isearch-bounds))
         )
    (if (< (mark) ismin)
        (kill-region (mark) ismin)
      (if (> (mark) ismax)
          (kill-region ismax (mark))
        (error "Internal error in isearch kill function.")))
    (isearch-exit)
    ))

(define-key isearch-mode-map [(meta z)] 'zap-to-isearch)
#+end_src
*** Projectile - Project management
