03-For-an-editor/init-write-documents.el
  ;; I use the jj key-chord for this; see the definitions for key-chord
(use-package avy-zap
  :defer t
  :bind
  (("M-z" . avy-zap-up-to-char-dwim)
   ("M-Z" . avy-zap-to-char-dwim)))

(use-package ace-isearch
  :config
  (progn
    (global-ace-isearch-mode +1) ;; start this for global
    ;;(setq ace-isearch-funtion-from-isearch 'swoop-from-isearch) ; need to install swoop
    ;;(define-key swoop-map (kbd "C-s") 'swoop-action-goto-line-next)
    ;;(define-key swoop-map (kbd "C-r") 'swoop-action-goto-line-prev)
    (setq ace-isearch-funtion-from-isearch 'helm-swoop-from-isearch)
    ;; (setq ace-isearch-funtion-from-isearch 'helm-occur-from-isearch) ; alternative way

    ;; blew configuration can be support for Chinese
    (defadvice ace-jump-char-category (around adv-ace-jump-support-umlauts activate)
      (unless (= (char-syntax (ad-get-arg 0)) ?w)
        ad-do-it)
      (setq ad-return-value 'alpha))

    ;; base configuration 
    (custom-set-variables
     '(ace-isearch-input-length 6)
     '(ace-isearch-jump-delay 0.25)
     '(ace-isearch-function 'ace-jump-word-mode)
     ;;'(ace-isearch-function 'avy-goto-char)
     '(ace-isearch-use-jump 'printing-char))
    (define-key isearch-mode-map (kbd "C-'") 'ace-isearch-jump-during-isearch)
    )
)

(defun zap-to-isearch (rbeg rend)
  "Kill the region between the mark and the closest portion of
the isearch match string. The behaviour is meant to be analogous
to zap-to-char; let's call it zap-to-isearch. The deleted region
does not include the isearch word. This is meant to be bound only
in isearch mode.  The point of this function is that oftentimes
you want to delete some portion of text, one end of which happens
to be an active isearch word. The observation to make is that if
you use isearch a lot to move the cursor around (as you should,
it is much more efficient than using the arrows), it happens a
lot that you could just delete the active region between the mark
and the point, not include the isearch word."
  (interactive "r")
  (when (not mark-active)
    (error "Mark is not active"))
  (let* ((isearch-bounds (list isearch-other-end (point)))
         (ismin (apply 'min isearch-bounds))
         (ismax (apply 'max isearch-bounds))
         )
    (if (< (mark) ismin)
        (kill-region (mark) ismin)
      (if (> (mark) ismax)
          (kill-region ismax (mark))
        (error "Internal error in isearch kill function.")))
    (isearch-exit)
    ))

(define-key isearch-mode-map [(meta z)] 'zap-to-isearch)
