03-For-an-editor/init-write-documents.org
**** Configuration
     #+begin_src emacs-lisp :tangle yes
       (use-package projectile
         ;; :defer t
         :diminish projectile-mode
         :config
         (progn
           (setq projectile-keymap-prefix (kbd "C-c p"))
           (setq projectile-completion-system 'default)
           (setq projectile-enable-caching t)
           (setq projectile-indexing-method 'alien)
           (add-to-list 'projectile-globally-ignored-files "node-modules")
           ;; setting for projectile
           (setq projectile-other-file-alist '(("cpp" "h" "hpp" "ipp")
                                               ("ipp" "h" "hpp" "cpp")
                                               ("hpp" "h" "ipp" "cpp")
                                               ("cxx" "hxx" "ixx")
                                               ("ixx" "cxx" "hxx")
                                               ("hxx" "ixx" "cxx")
                                               ("c" "h")
                                               ("m" "h")
                                               ("mm" "h")
                                               ("h" "c" "cpp" "ipp" "hpp" "m" "mm")
                                               ("cc" "hh")
                                               ("hh" "cc")
                                               ("vert" "frag")
                                               ("frag" "vert")
                                               (nil "lock" "gpg")
                                               ("lock" "")
                                               ("gpg" "")
                                               ("js" "css" "html")))

           (add-to-list 'projectile-other-file-alist '("css" "js")) ;; switch from css -> js
           (add-to-list 'projectile-other-file-alist '("js" "css")) ;; switch from js -> css


           ;; setting for helm-projectile

           ;;(setq projectile-switch-project-action 'helm-projectile-find-file)
           (setq projectile-switch-project-action 'helm-projectile)

           )



         :config
         (projectile-global-mode))


       (use-package helm-projectile
         :defer t
         :init
         (setq helm-projectile-fuzzy-match t)
         )




     #+end_src
**** Key binding for helm-projectile
#+begin_src emacs-lisp :tangle yes
;; -----------------------------------------
;; helm-project
;; -----------------------------------------
(global-set-key (kbd "C-c h") 'helm-projectile)
  ;; Grep in a projectile
  (global-set-key (kbd "C-c p s g") 'helm-projectile-grep)


#+end_src
*** Chinese-font-setup
在Org-mode中，编辑表格并让表格的分隔线对齐是一件不太容易的事情，主要原因是因为Org-mode中编辑时字母与汉字同时存在时，则字母字体长度与汉字字体宽度不同的原因导致，因此这里的主要解决方案是找到一种通用等宽字体，通过字体的配置来达到最终表格对齐正常。
感谢Chinese-font-setup的包开发者：
**** Configuration
#+begin_src emacs-lisp :tangle yes
  ;; add font-config for chinese double-width fonts issue
  (use-package chinese-fonts-setup
    :config
    (setq cfs-profiles
          '("program" "org-mode" "read-book"))
  )

#+end_src
**** Shot key binding

#+begin_src emacs-lisp :tangle yes
;; Reset Increase Font size and Descrease Font size short key binding after using chinese-font-setup plugin
;; Reference: https://github.com/tumashu/chinese-fonts-setup
(global-unset-key (kbd "C-x C-=")) ;; remove original font-resize
(global-set-key (kbd "C-x C-=") 'cfs-increase-fontsize)
(global-set-key (kbd "C-x M-=") 'cfs-decrease-fontsize)

#+end_src
*** WAITING Smartparens                                             :WAITING:
    - State "WAITING"    from ""           [2016-05-30 Mon 20:36]
**** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package smartparens
    :config
    (require 'smartparens-config)
    (setq sp-autoescape-string-quote nil)
    (--each '(css-mode-hook
              restclient-mode-hook
              js-mode-hook
              java-mode
              ruby-mode
              markdown-mode
              groovy-mode)
      (add-hook it 'turn-on-smartparens-mode))

  )


#+end_src
*** Expand-region
**** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :config
    ;; Don't use expand-region fast keys
    (setq expand-region-fast-keys-enabled nil)

    ;; Show expand-region command used
    (setq er--show-expansion-message t)

    )
#+end_src
**** Key bindings for Expand-region
#+begin_src emacs-lisp :tangle yes
;; Expand region (increases selected region by semantic units)
(global-set-key (kbd "C-'") 'er/expand-region)

#+end_src
*** Swap-buffer

**** Configuration
#+begin_src emacs-lisp :tangle yes
  ;; add smart swap buffers in multi-windows
  (use-package swap-buffers
    :config
    (global-set-key (kbd "C-x 5") 'swap-buffers)
  )


#+end_src
*** Email Reader - Mu4e

Please find [[file:../lisp/init-mu4e.org][Init-Mu4e]].

#+begin_src emacs-lisp :tangle yes
;; load my mu4e configuration from lisp/init-mu4e.el
(require 'init-mu4e)
;;(load-library "init-mu4e")
#+end_src
*** Multiple cursors mode
Multiple cursor是一个非常强大的多位置同时编辑的编辑模式，文档可参考：
这里有一个介绍详细的视频：http://emacsrocks.com/e13.html
