03-For-an-editor/init-write-documents.md

## Projectile - Project management<a id="sec-1-22" name="sec-1-22"></a>

### Configuration<a id="sec-1-22-1" name="sec-1-22-1"></a>

    (use-package projectile
      ;; :defer t
      :diminish projectile-mode
      :config
      (progn
        (setq projectile-keymap-prefix (kbd "C-c p"))
        (setq projectile-completion-system 'default)
        (setq projectile-enable-caching t)
        (setq projectile-indexing-method 'alien)
        (add-to-list 'projectile-globally-ignored-files "node-modules")
        ;; setting for projectile
        (setq projectile-other-file-alist '(("cpp" "h" "hpp" "ipp")
                                            ("ipp" "h" "hpp" "cpp")
                                            ("hpp" "h" "ipp" "cpp")
                                            ("cxx" "hxx" "ixx")
                                            ("ixx" "cxx" "hxx")
                                            ("hxx" "ixx" "cxx")
                                            ("c" "h")
                                            ("m" "h")
                                            ("mm" "h")
                                            ("h" "c" "cpp" "ipp" "hpp" "m" "mm")
                                            ("cc" "hh")
                                            ("hh" "cc")
                                            ("vert" "frag")
                                            ("frag" "vert")
                                            (nil "lock" "gpg")
                                            ("lock" "")
                                            ("gpg" "")
                                            ("js" "css" "html")))
    
        (add-to-list 'projectile-other-file-alist '("css" "js")) ;; switch from css -> js
        (add-to-list 'projectile-other-file-alist '("js" "css")) ;; switch from js -> css
    
    
        ;; setting for helm-projectile
    
        ;;(setq projectile-switch-project-action 'helm-projectile-find-file)
        (setq projectile-switch-project-action 'helm-projectile)
    
        )
    
    
    
      :config
      (projectile-global-mode))
    
    
    (use-package helm-projectile
      :defer t
      :init
      (setq helm-projectile-fuzzy-match t)
      )

### Key binding for helm-projectile<a id="sec-1-22-2" name="sec-1-22-2"></a>

    ;; -----------------------------------------
    ;; helm-project
    ;; -----------------------------------------
    (global-set-key (kbd "C-c h") 'helm-projectile)
      ;; Grep in a projectile
      (global-set-key (kbd "C-c p s g") 'helm-projectile-grep)

## Chinese-font-setup<a id="sec-1-23" name="sec-1-23"></a>

在Org-mode中，编辑表格并让表格的分隔线对齐是一件不太容易的事情，主要原因是因为Org-mode中编辑时字母与汉字同时存在时，则字母字体长度与汉字字体宽度不同的原因导致，因此这里的主要解决方案是找到一种通用等宽字体，通过字体的配置来达到最终表格对齐正常。
感谢Chinese-font-setup的包开发者：

### Configuration<a id="sec-1-23-1" name="sec-1-23-1"></a>

    ;; add font-config for chinese double-width fonts issue
    (use-package chinese-fonts-setup
      :config
      (setq cfs-profiles
            '("program" "org-mode" "read-book"))
    )

### Shot key binding<a id="sec-1-23-2" name="sec-1-23-2"></a>

    ;; Reset Increase Font size and Descrease Font size short key binding after using chinese-font-setup plugin
    ;; Reference: https://github.com/tumashu/chinese-fonts-setup
    (global-unset-key (kbd "C-x C-=")) ;; remove original font-resize
    (global-set-key (kbd "C-x C-=") 'cfs-increase-fontsize)
    (global-set-key (kbd "C-x M-=") 'cfs-decrease-fontsize)

## WAITING Smartparens     :WAITING:<a id="sec-1-24" name="sec-1-24"></a>

-   State "WAITING"    from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-30 Mon 20:36]</span></span>

### Configuration<a id="sec-1-24-1" name="sec-1-24-1"></a>

    (use-package smartparens
      :config
      (require 'smartparens-config)
      (setq sp-autoescape-string-quote nil)
      (--each '(css-mode-hook
                restclient-mode-hook
                js-mode-hook
                java-mode
                ruby-mode
                markdown-mode
                groovy-mode)
        (add-hook it 'turn-on-smartparens-mode))
    
    )

## Expand-region<a id="sec-1-25" name="sec-1-25"></a>

### Configuration<a id="sec-1-25-1" name="sec-1-25-1"></a>

    (use-package expand-region
      :config
      ;; Don't use expand-region fast keys
      (setq expand-region-fast-keys-enabled nil)
    
      ;; Show expand-region command used
      (setq er--show-expansion-message t)
    
      )

### Key bindings for Expand-region<a id="sec-1-25-2" name="sec-1-25-2"></a>

    ;; Expand region (increases selected region by semantic units)
    (global-set-key (kbd "C-'") 'er/expand-region)

## Swap-buffer<a id="sec-1-26" name="sec-1-26"></a>

### Configuration<a id="sec-1-26-1" name="sec-1-26-1"></a>

    ;; add smart swap buffers in multi-windows
    (use-package swap-buffers
      :config
      (global-set-key (kbd "C-x 5") 'swap-buffers)
    )

## Email Reader - Mu4e<a id="sec-1-27" name="sec-1-27"></a>

Please find [Init-Mu4e](../lisp/init-mu4e.md).

    ;; load my mu4e configuration from init-mu4e.el
    ;;(require 'init-mu4e)
      (starter-kit-load "03-For-an-editor/init-mu4e.org")
    
    
    ;;(load-library "init-mu4e")

## Multiple cursors mode<a id="sec-1-28" name="sec-1-28"></a>

Multiple cursor是一个非常强大的多位置同时编辑的编辑模式，文档可参考：
这里有一个介绍详细的视频：<http://emacsrocks.com/e13.html>
