03-For-an-editor/init-write-documents.el

(use-package projectile
  ;; :defer t
  :diminish projectile-mode
  :config
  (progn
    (setq projectile-keymap-prefix (kbd "C-c p"))
    (setq projectile-completion-system 'default)
    (setq projectile-enable-caching t)
    (setq projectile-indexing-method 'alien)
    (add-to-list 'projectile-globally-ignored-files "node-modules")
    ;; setting for projectile
    (setq projectile-other-file-alist '(("cpp" "h" "hpp" "ipp")
                                        ("ipp" "h" "hpp" "cpp")
                                        ("hpp" "h" "ipp" "cpp")
                                        ("cxx" "hxx" "ixx")
                                        ("ixx" "cxx" "hxx")
                                        ("hxx" "ixx" "cxx")
                                        ("c" "h")
                                        ("m" "h")
                                        ("mm" "h")
                                        ("h" "c" "cpp" "ipp" "hpp" "m" "mm")
                                        ("cc" "hh")
                                        ("hh" "cc")
                                        ("vert" "frag")
                                        ("frag" "vert")
                                        (nil "lock" "gpg")
                                        ("lock" "")
                                        ("gpg" "")
                                        ("js" "css" "html")))

    (add-to-list 'projectile-other-file-alist '("css" "js")) ;; switch from css -> js
    (add-to-list 'projectile-other-file-alist '("js" "css")) ;; switch from js -> css


    ;; setting for helm-projectile

    ;;(setq projectile-switch-project-action 'helm-projectile-find-file)
    (setq projectile-switch-project-action 'helm-projectile)

    )



  :config
  (projectile-global-mode))


(use-package helm-projectile
  :defer t
  :init
  (setq helm-projectile-fuzzy-match t)
  )

;; -----------------------------------------
;; helm-project
;; -----------------------------------------
(global-set-key (kbd "C-c h") 'helm-projectile)
  ;; Grep in a projectile
  (global-set-key (kbd "C-c p s g") 'helm-projectile-grep)

;; add font-config for chinese double-width fonts issue
(use-package chinese-fonts-setup
  :config
  (setq cfs-profiles
        '("program" "org-mode" "read-book"))
)

;; Reset Increase Font size and Descrease Font size short key binding after using chinese-font-setup plugin
;; Reference: https://github.com/tumashu/chinese-fonts-setup
(global-unset-key (kbd "C-x C-=")) ;; remove original font-resize
(global-set-key (kbd "C-x C-=") 'cfs-increase-fontsize)
(global-set-key (kbd "C-x M-=") 'cfs-decrease-fontsize)

(use-package smartparens
  :config
  (require 'smartparens-config)
  (setq sp-autoescape-string-quote nil)
  (--each '(css-mode-hook
            restclient-mode-hook
            js-mode-hook
            java-mode
            ruby-mode
            markdown-mode
            groovy-mode)
    (add-hook it 'turn-on-smartparens-mode))

)

(use-package expand-region
  :config
  ;; Don't use expand-region fast keys
  (setq expand-region-fast-keys-enabled nil)

  ;; Show expand-region command used
  (setq er--show-expansion-message t)

  )

;; Expand region (increases selected region by semantic units)
(global-set-key (kbd "C-'") 'er/expand-region)

;; add smart swap buffers in multi-windows
(use-package swap-buffers
  :config
  (global-set-key (kbd "C-x 5") 'swap-buffers)
)

;; load my mu4e configuration from init-mu4e.el
;;(require 'init-mu4e)
  (starter-kit-load "03-For-an-editor/init-mu4e.org")


;;(load-library "init-mu4e")
