03-For-an-editor/init-write-documents.md

### Configuration<a id="sec-1-28-1" name="sec-1-28-1"></a>

    (use-package multiple-cursors
      :defer t
      :bind
       (("C-c m t" . mc/mark-all-like-this)
        ("C-c m m" . mc/mark-all-like-this-dwim)
        ("C-c m l" . mc/edit-lines)
        ("C-c m e" . mc/edit-ends-of-lines)
        ("C-c m a" . mc/edit-beginnings-of-lines)
        ("C-c m n" . mc/mark-next-like-this)
        ("C-c m p" . mc/mark-previous-like-this)
        ("C-c m s" . mc/mark-sgml-tag-pair)
        ("C-c m d" . mc/mark-all-like-this-in-defun)))
    (use-package phi-search
      :defer t)
    (use-package phi-search-mc
      :defer t
      :config (phi-search-mc/setup-keys))
    (use-package mc-extras
      :defer t
      :config (define-key mc/keymap (kbd "C-. =") 'mc/compare-chars))

### Short-key binding<a id="sec-1-28-2" name="sec-1-28-2"></a>

    ;; add multi cursors:
    ;;(require 'multiple-cursors)
    (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
    (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
    
    (global-set-key (kbd "C-S-c C-e") 'mc/edit-ends-of-lines)
    (global-set-key (kbd "C-S-c C-a") 'mc/edit-beginnings-of-lines)

## Latex mode<a id="sec-1-29" name="sec-1-29"></a>

    ;;; latex --- Summary
    ;;; Config for latex
    (use-package auctex
      :defer t)
    
    (use-package cdlatex
      :defer t
      :config
      (add-hook 'LaTex-mode-hook 'turn-on-org-cdlatex) ;; with AUCTex LaTex mode-line
      (add-hook 'LaTex-mode-hook 'turn-on-org-cdlatex) ;; with Emacs latex mode
    )
    ;; (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)   ; with AUCTeX LaTeX mode
    ;; (add-hook 'latex-mode-hook 'turn-on-cdlatex)   ; with Emacs latex mode
    
    ;; latex-preview-pane is a minor mode for Emacs that enables you to preview your LaTeX files directly in Emacs.
    
    
    (use-package latex-preview-pane
      :defer t
      :config
      (latex-preview-pane-enable))
    ;;(latex-preview-pane-enable)
    
    ;; magical syntax highlighting for LaTeX-mode buffers
    ;;(require-package 'magic-latex-buffer)
    (use-package magic-latex-buffer
      :defer t
      :config
      (add-hook 'latex-mode-hook 'magic-latex-buffer))
    ;;(add-hook 'latex-mode-hook 'magic-latex-buffer)
    
    ;;  Adds several useful functionalities to LaTeX-mode. http://github.com/Bruce-Connor/latex-extra
    
    (use-package latex-extra
      :defer t
      :config
      (add-hook 'latex-mode-hook 'latex-extra-mode))
    
    ;;(add-hook 'LaTeX-mode-hook #'latex-extra-mode)

## TODO Wgrep<a id="sec-1-30" name="sec-1-30"></a>

Wgrep是一个可以允许我们在grep模式下进行直接修改的工具，可以允许我们批量添加上Multiple cursors，然后进行批量修改的工具。在快速修改文件时非常方便，类似于sed的批量匹配，批量修改。

    ;;; 未配置详细操作，暂时不使用
    (use-package wgrep)

## Tabbar<a id="sec-1-31" name="sec-1-31"></a>

Tabbar，在Emacs中显示一个文件的切换标签，并且标签文件按projectile的进行分组显示，以方便在同一个项目中进行维护和切换文件。
