03-For-an-editor/init-write-documents.el

(use-package perspective
  :config
  ;; Enable perspective mode
  (progn
    (persp-mode t)
    ;; TODO: implement persp-last as before-advice on persp-switch (?)

    (defmacro custom-persp (name &rest body)
      `(let ((initialize (not (gethash ,name perspectives-hash)))
             (current-perspective persp-curr))
         (persp-switch ,name)
         (when initialize ,@body)
         (setq persp-last current-perspective)))

    ;; Jump to last perspective
    (defun custom-persp-last ()
      (interactive)
      (persp-switch (persp-name persp-last)))

    (define-key persp-mode-map (kbd "C-x p -") 'custom-persp-last)
    )
)

;; Use C-f during file selection to switch to regular find-file
(ido-mode t)
;;(ido-everywhere t)
(setq ido-enable-flex-matching t)
(setq ido-use-filename-at-point nil)
(setq ido-auto-merge-work-directories-length 0)
(setq ido-use-virtual-buffers t)

(use-package mmm-mode
  :config
  ;;(require 'mmm-auto)
  (setq mmm-global-mode 'buffers-with-submode-classes)
  (setq mmm-submode-decoration-level 2)
  
  )
